

Queries and Scripts in easy to copy and paste text.
Slide 7 Local Inventory Counts
| tstats summariesonly=true allow_old_summaries=true sum(All_Traffic.bytes) as bytes values(sourcetype) as sourcetype count from datamodel="Network_Traffic"   groupby All_Traffic.src_ip, All_Traffic.src_mac All_Traffic.dest_mac _time
| rename All_Traffic.* as * 
| eval mac=src_mac+"|"+dest_mac
| makemv delim="|" mac
| mvexpand mac
| search mac!=33:33* mac!=FF:FF:FF*
| timechart dc(mac) as mac span=1d


Slide 9 Non-Splunk Inventory (RunZero)
splunkuser@splunkhost]# rumble_get.sh
curl -H "Authorization: Bearer [api key]" https://console.rumble.run/api/v1.0/export/org/assets.csv > /opt/splunk/etc/apps/splunkapp/lookups/assets.csv


Slide 10 ping sweep -> arp -> csv
[user@splunkhost ~]$ inventory_nmap_arp.sh
#
# jpcallahan professionalparanoid.com
#
nmap -sP 192.168.0.1-254 |grep MAC |sed 's/^/\n/;ta;:a;s/\n$//;t;/\n /{x;/./{x;s/\n /_\n/;ta};x;s/\n / \n/;ta};/\n(/{x;s/^/x/;x;s/\n(/(\n/;ta};/\n)/{x;s/.//;x;s/\n)/)\n/;ta};s/\n\([^ ()]*\)/\1\n/;ta' |sed 's/MAC Address\://g;s/\ /\,/g;s/\(Unknown\)//g;s/()//g;1i ip,mac,oui' > /opt/splunk/etc/apps/myapp/lookups/inventory_ splunkhost _nmap_mac.csv
#
#
#
arp -a |cut -d " " -f1,2,4 |sort |uniq |  /bin/sed 's/[(),]//g; s/\ /\,/g; s/\?//g;1i  client,ip,mac' > /opt/splunk/etc/apps/myapp/lookups/inventory_ splunkhost _arp2.csv


|inputlookup inventory_splunkhost_arp2.csv
| append
    [| inputlookup inventory_ splunkhost _nmap_mac.csv]    
| eval mac=lower(if(mac="<incomplete>","<incomplete>"+ip,mac))
| dedup mac


Slide 16  Destination Port Baselining Experiment
| tstats summariesonly=false allow_old_summaries=true count from datamodel=Network_Traffic where All_Traffic.action!=blocked  AND All_Traffic.src=192.168.0.0/24 by All_Traffic.user All_Traffic.src All_Traffic.dest All_Traffic.transport  All_Traffic.dest_port _time
| rename All_Traffic.* as *
| fillnull value="(unk)" protocol| eval dpt_range=case(dest_port<1024,dest_port,dest_port<49151,"Regisgtered",1=1,"Rendom_High")
| eval transport=if(dest_port="0","icmp",transport)
| stats values(dest_port) as dptv count by  src dpt_range transport| eval proto_count=(count+"-"+transport)
| lookup mac_tracking.csv ip as src outputnew client type
| search  type=iot* type IN(iot_light)
| sort + dptv 
| chart values(proto_count)  by  client dpt_range limit=0



Slide 19 
https://dev.splunk.com/enterprise/dev_license/
https://www.splunk.com/en_us/resources/personalized-dev-test-licenses.html


